Masmiseim36/iMXRT/targets/iMXRT/Loader2/drivers/iMXRT1180/fsl_clock.c
    reg &= ~ANADIG_PLL_SYS_PLL3_CTRL_HOLD_RING_OFF_MASK;
    ANADIG_PLL->SYS_PLL3_CTRL = reg;

    /* Wait for PLL stable */
    while (ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_STABLE_MASK !=
           (ANADIG_PLL->SYS_PLL3_CTRL & ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_STABLE_MASK))
    {
    }

    reg |= ANADIG_PLL_SYS_PLL3_CTRL_ENABLE_CLK(1) | ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_DIV2(1);
    ANADIG_PLL->SYS_PLL3_CTRL = reg;

    reg &= ~ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_GATE_MASK;
    ANADIG_PLL->SYS_PLL3_CTRL = reg;
}

void CLOCK_DeinitSysPll3(void)
{
    ANADIG_PLL->SYS_PLL3_PFD |=
        ANADIG_PLL_SYS_PLL3_PFD_PFD0_DIV1_CLKGATE(1) | ANADIG_PLL_SYS_PLL3_PFD_PFD1_DIV1_CLKGATE(1) |
        ANADIG_PLL_SYS_PLL3_PFD_PFD2_DIV1_CLKGATE(1) | ANADIG_PLL_SYS_PLL3_PFD_PFD3_DIV1_CLKGATE(1);

    ANADIG_PLL->SYS_PLL3_CTRL |= ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_GATE_MASK;
    ANADIG_PLL->SYS_PLL3_CTRL &= ~(ANADIG_PLL_SYS_PLL3_CTRL_ENABLE_CLK_MASK | ANADIG_PLL_SYS_PLL3_CTRL_POWERUP_MASK |
                                   ANADIG_PLL_SYS_PLL3_CTRL_PLL_REG_EN_MASK);
}

/*!
 * brief Check if Sys PLL3 PFD is enabled
 *
 * param pfd PFD control name
 * return PFD bypass status.
 *         - true: power on.
 *         - false: power off.
 * note Only useful in software control mode.
 */
bool CLOCK_IsSysPll3PfdEnabled(clock_pfd_t pfd)
{
    return ((ANADIG_PLL->SYS_PLL3_PFD & (uint32_t)ANADIG_PLL_SYS_PLL3_PFD_PFD0_DIV1_CLKGATE_MASK
                                            << (8UL * (uint8_t)pfd)) == 0U);
}

void CLOCK_SetPllBypass(clock_pll_t pll, bool bypass)
{
    switch (pll)
    {
        case kCLOCK_PllArm:
            ANADIG_PLL->ARM_PLL_CTRL = bypass ? (ANADIG_PLL->ARM_PLL_CTRL | ANADIG_PLL_ARM_PLL_CTRL_BYPASS_MASK) :
                                                (ANADIG_PLL->ARM_PLL_CTRL & ~ANADIG_PLL_ARM_PLL_CTRL_BYPASS_MASK);
            break;
        case kCLOCK_PllSys1:
            ANATOP_PllBypass(ETHERNET_PLL, bypass);
            break;
        case kCLOCK_PllSys2:
            ANADIG_PLL->SYS_PLL2_CTRL = bypass ? (ANADIG_PLL->SYS_PLL2_CTRL | ANADIG_PLL_SYS_PLL2_CTRL_BYPASS_MASK) :
                                                 (ANADIG_PLL->SYS_PLL2_CTRL & ~ANADIG_PLL_SYS_PLL2_CTRL_BYPASS_MASK);
            break;
        case kCLOCK_PllSys3:
            ANADIG_PLL->SYS_PLL3_CTRL = bypass ? (ANADIG_PLL->SYS_PLL3_CTRL | ANADIG_PLL_SYS_PLL3_CTRL_BYPASS_MASK) :
                                                 (ANADIG_PLL->SYS_PLL3_CTRL & ~ANADIG_PLL_SYS_PLL3_CTRL_BYPASS_MASK);
            break;
        case kCLOCK_PllAudio:
            ANATOP_PllBypass(AUDIO_PLL, bypass);
            break;
        default:
            assert(false);
            break;
    }
}

static void ANATOP_PllSetPower(PLL_Type *base, bool enable)
{
    if (enable)
    {
        base->CTRL0.SET = PLL_CTRL0_POWERUP_MASK | PLL_CTRL0_HOLD_RING_OFF_MASK;
    }
    else
    {
        base->CTRL0.CLR = PLL_CTRL0_POWERUP_MASK;
    }
}

static void ANATOP_PllBypass(PLL_Type *base, bool bypass)
{
    if (bypass)
    {
        base->CTRL0.SET = PLL_CTRL0_BYPASS_MASK;
    }
    else
    {
        base->CTRL0.CLR = PLL_CTRL0_BYPASS_MASK;
    }
}

static void ANATOP_PllEnablePllReg(PLL_Type *base, bool enable)
{
    if (enable)
    {
        base->CTRL0.SET = PLL_CTRL0_PLL_REG_EN_MASK;
    }
    else
    {
        base->CTRL0.CLR = PLL_CTRL0_PLL_REG_EN_MASK;
    }
}

static void ANATOP_PllHoldRingOff(PLL_Type *base, bool off)
{
    if (off)
    {
        base->CTRL0.SET = PLL_CTRL0_HOLD_RING_OFF_MASK;
    }
    else
    {
        base->CTRL0.CLR = PLL_CTRL0_HOLD_RING_OFF_MASK;
    }
}

static void ANATOP_PllToggleHoldRingOff(PLL_Type *base, uint32_t delay_us)
{
    ANATOP_PllHoldRingOff(base, true);
    SDK_DelayAtLeastUs(delay_us, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    ANATOP_PllHoldRingOff(base, false);
}

static void ANATOP_PllEnableSs(PLL_Type *base, bool enable)
{
    if (enable)
    {
        base->CTRL0.SET = PLL_CTRL0_ENABLE_MASK;
    }
    else
    {
        base->CTRL0.CLR = PLL_CTRL0_ENABLE_MASK;
    }
}

static void ANATOP_PllEnableClk(PLL_Type *base, bool enable)
{
    if (enable)
    {
        base->CTRL0.SET = PLL_CTRL0_ENABLE_MASK;
    }
    else
    {
        base->CTRL0.CLR = PLL_CTRL0_ENABLE_MASK;
    }
}

static void ANATOP_PllConfigure(
    PLL_Type *base, uint8_t div, uint32_t numer, uint8_t post_div, uint32_t denom, const clock_pll_ss_config_t *ss)
{
    if (base != ETHERNET_PLL)
    {
        ANATOP_PllSetPower(base, false);
    }
    if (ss != NULL)
    {
        base->SPREAD_SPECTRUM.RW =
            PLL_SPREAD_SPECTRUM_STEP(ss->step) | PLL_SPREAD_SPECTRUM_STOP(ss->stop) | PLL_SPREAD_SPECTRUM_ENABLE_MASK;
    }
    base->NUMERATOR.RW   = numer;
    base->DENOMINATOR.RW = denom;
    base->CTRL0.CLR      = PLL_CTRL0_DIV_SELECT_MASK;
    base->CTRL0.SET      = PLL_CTRL0_DIV_SELECT(div);
    if (base != ETHERNET_PLL)
    {
        base->CTRL0.CLR = PLL_CTRL0_POST_DIV_SEL_MASK;
        base->CTRL0.SET = PLL_CTRL0_POST_DIV_SEL(post_div);
    }
    ANATOP_PllEnablePllReg(base, true);
    SDK_DelayAtLeastUs(100, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    ANATOP_PllSetPower(base, true);
}

static void ANATOP_AudioPllGate(bool enable)
{
    if (!enable)
    {
        ANADIG_PLL->PLL_AUDIO_CTRL &= ~ANADIG_PLL_PLL_AUDIO_CTRL_PLL_AUDIO_GATE_MASK;
    }
    else
    {
        ANADIG_PLL->PLL_AUDIO_CTRL |= ANADIG_PLL_PLL_AUDIO_CTRL_PLL_AUDIO_GATE_MASK;
    }
}

static void ANATOP_AudioPllSwEnClk(bool enable)
{
    if (!enable)
    {
        ANADIG_PLL->PLL_AUDIO_CTRL &= ~ANADIG_PLL_PLL_AUDIO_CTRL_ENABLE_CLK_MASK;
    }
    else
    {
        ANADIG_PLL->PLL_AUDIO_CTRL |= ANADIG_PLL_PLL_AUDIO_CTRL_ENABLE_CLK_MASK;
    }
}

status_t CLOCK_InitAudioPllWithFreq(uint32_t freqInMhz, bool ssEnable, uint32_t ssRange, uint32_t ssMod)
{
    clock_audio_pll_config_t config = {0};
    config.ssEnable                 = ssEnable;

    if (kStatus_Success == CLOCK_CalcAudioPllFreq(&config, freqInMhz))
    {
        if (config.ssEnable)
        {
            clock_pll_ss_config_t ss = {0};
            CLOCK_CalcPllSpreadSpectrum(config.denominator, ssRange, ssMod, &ss);
            config.ss = &ss;
        }
        CLOCK_InitAudioPll(&config);
        return kStatus_Success;
    }
    return kStatus_Fail;
}

void CLOCK_InitAudioPll(const clock_audio_pll_config_t *config)
{
    uint32_t reg;
    bool pllStable = false;

    PMU_StaticEnablePllLdo(ANADIG_PMU);

    reg = ANADIG_PLL->PLL_AUDIO_CTRL;
    if ((reg & (ANADIG_PLL_PLL_AUDIO_CTRL_PLL_AUDIO_STABLE_MASK | ANADIG_PLL_PLL_AUDIO_CTRL_ENABLE_CLK_MASK)) ==
        (ANADIG_PLL_PLL_AUDIO_CTRL_PLL_AUDIO_STABLE_MASK | ANADIG_PLL_PLL_AUDIO_CTRL_ENABLE_CLK_MASK))
    {
        pllStable = true;
    }
    /* bypass pll */
    ANATOP_PllBypass(AUDIO_PLL, true);

    if (pllStable)
    {
        /* sw enable clock */
        ANATOP_AudioPllSwEnClk(false);
        /* gate clock */
        ANATOP_AudioPllGate(true);
        ANATOP_PllEnableClk(AUDIO_PLL, false);
        ANATOP_PllSetPower(AUDIO_PLL, false);
        ANATOP_PllEnablePllReg(AUDIO_PLL, false);
    }

